<?xml version="1.0" ?>
<net name="rpn" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 64, 496, 432" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>496</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="199" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="200" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="121/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="121/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>496</dim>
					<dim>432</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="5" name="121" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>496</dim>
					<dim>432</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="121">
					<dim>1</dim>
					<dim>64</dim>
					<dim>498</dim>
					<dim>434</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="123/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="34" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="122" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>498</dim>
					<dim>434</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_3477" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="73762" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="123/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="123">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="124" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="124">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="126/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="73890" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="7">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="125" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_34803485" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="147618" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="126/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="126">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="127" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="127">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="129/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="147746" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="13">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="128" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_34883493" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="221474" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="129/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="129">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="130" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="130">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="132/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="221602" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="19">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="131" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_34963501" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="295330" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="132/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="132">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="133" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="133">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="135/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128, 1, 1" offset="295458" size="16384"/>
			<output>
				<port id="0" precision="FP16" names="25">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="134" type="ConvolutionBackpropData" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" output_padding="0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_36163621" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="311842" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="135/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="135">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="136" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="136">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="204" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="205" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="137/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="137/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="35" name="137" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="137">
					<dim>1</dim>
					<dim>64</dim>
					<dim>250</dim>
					<dim>218</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="139/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="312098" size="147456"/>
			<output>
				<port id="0" precision="FP16" names="31">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="138" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>250</dim>
					<dim>218</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_35043509" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="459554" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="139/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="139">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="140" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="140">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="142/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="459810" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="37">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="141" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_35123517" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="754722" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="142/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="142">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="143" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="143">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="145/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="754978" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="43">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="144" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_35203525" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1049890" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="145/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="145">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="146" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="146">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="148/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1050146" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="49">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="147" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_35283533" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1345058" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="148/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="148">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="149" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="149">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="151/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1345314" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="55">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="150" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_35363541" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1640226" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="151/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="151">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="152" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="152">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="154/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="1640482" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="61">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="153" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_35443549" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="1935394" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="154/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="154">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="155" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="155">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="157/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 2, 2" offset="1935650" size="131072"/>
			<output>
				<port id="0" precision="FP16" names="67">
					<dim>128</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="156" type="ConvolutionBackpropData" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" output_padding="0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="data_add_36083613" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="2066722" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="157/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="157">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="158" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="158">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="209" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="210" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="159/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="32" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="74" name="159/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="75" name="159" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>124</dim>
					<dim>108</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="159">
					<dim>1</dim>
					<dim>128</dim>
					<dim>126</dim>
					<dim>110</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="161/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 3, 3" offset="2066978" size="589824"/>
			<output>
				<port id="0" precision="FP16" names="73">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="160" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>126</dim>
					<dim>110</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="data_add_35523557" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="2656802" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="161/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="161">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="162" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="162">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="164/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="2657314" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="79">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="163" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_35603565" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="3836962" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="164/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="164">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="165" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="165">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="167/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="3837474" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="85">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="166" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="data_add_35683573" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="5017122" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="167/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="167">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="168" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="168">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="170/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="5017634" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="91">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="169" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_35763581" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="6197282" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="170/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="170">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="171" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="171">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="173/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="6197794" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="97">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="172" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_35843589" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="7377442" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="173/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="173">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="174" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="174">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="176/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="7377954" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="103">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="175" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="data_add_35923597" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="8557602" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="176/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="176">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="177" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="177">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="179/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 4, 4" offset="8558114" size="1048576"/>
			<output>
				<port id="0" precision="FP16" names="109">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="178" type="ConvolutionBackpropData" version="opset1">
			<data strides="4, 4" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" output_padding="0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>54</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="data_add_36003605" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="9606690" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="179/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="179">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="180" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="180">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="181" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="181">
					<dim>1</dim>
					<dim>384</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="119" type="Const" version="opset1">
			<data element_type="f16" shape="4, 384, 1, 1" offset="9606946" size="3072"/>
			<output>
				<port id="0" precision="FP16" names="119">
					<dim>4</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="186/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="186/Dims1999" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 1, 1" offset="9610018" size="8"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="186" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="186">
					<dim>1</dim>
					<dim>4</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="197" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="9610026" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="187" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>248</dim>
					<dim>216</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="187">
					<dim>1</dim>
					<dim>248</dim>
					<dim>216</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="187/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>248</dim>
					<dim>216</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="119" name="115" type="Const" version="opset1">
			<data element_type="f16" shape="2, 384, 1, 1" offset="9610058" size="1536"/>
			<output>
				<port id="0" precision="FP16" names="115">
					<dim>2</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="183/WithoutBiases" type="Convolution" version="opset1">
